// 1 переменная 
let one = 'первая переменная let, которую можно поменять местами';

// 2 переменная 
var two = 'вторая переменная var, старый способ которым никто не пользуеться';

// 3 переменная
const tree = 'третия переменная const, в отличие от  let она не меняет типы данных, изпользуеться для постояных данных';

// типы данных

// name или же string строка, просто текст 
let name = 'Самир';

// Number число цифра, используетться для математических чисел
let num = '1234567890';

// Boolean это правильно и неправильно true false
let bool = true;

// Null пусто но что-то есть
let Null;

// Undefined пустой сосуд но что-то есть 
let und = undefined;

// Object втутри обьекта храняться типы данных
let obj ={
    name: 'samir',
    age: 0,
}